soap-service/src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://zurnov.com">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getCryptoRequest>
            <gs:ticker>ETH</gs:ticker>
        </gs:getCryptoRequest>
    </soapenv:Body>
</soapenv:Envelope>
